src_ext/Documents/УЗ_РасчетЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_РасчетЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перемещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПеремещениеДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УЗ_НачисленияПедагогам</v8:Type>
								<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_РасчетыПоЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_РасчетыПоЗарплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НеИзменять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_УрокиВРасчетахЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_УрокиВРасчетахЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Урок</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>НомерРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Documents/УЗ_ПеремещениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПеремещениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбученияОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьДвиженияПоВзаиморасчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбученияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_РасходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_РасходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Document.УЗ_РасчетЗарплаты</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_РасчетЗарплаты/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

//В9: уроки ведомости — в регистр УЗ_УрокиВРасчетахЗарплаты (движения расчёта; при отмене проведения и удалении
//платформа их удаляет). По нему урок не отменяется и не меняет начисление, пока расчёт проведён, — и у менеджера,
//которому сами расчёты не видны. Одна процедура для проведения и обновления данных.
Процедура ЗаписатьУрокиВРасчете(Набор, Расчет) Экспорт

	Набор.Очистить();
	Уроки = Новый Соответствие;
	Для Каждого СтрокаДД Из Расчет.ДД Цикл
		Если ТипЗнч(СтрокаДД.Документ) = Тип("ДокументСсылка.УЗ_Урок") И ЗначениеЗаполнено(СтрокаДД.Документ)
			И Уроки[СтрокаДД.Документ] = Неопределено Тогда
			Уроки.Вставить(СтрокаДД.Документ, Истина);
			Запись = Набор.Добавить();
			Запись.Урок = СтрокаДД.Документ;
			Запись.НомерРасчета = Расчет.Номер;
			Запись.ДатаРасчета = Расчет.Дата;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//Заполняет таблицу начислениями педагога строго за период документа (без расширения до месяца) — невыплаченное
//по каждому источнику (урок, начисление педагогам): начисление источника минус то, что уже вошло в другие
//проведённые расчёты педагога (Документы.УЗ_РасчетЗарплаты.НевыплаченныеНачисления). Источник, ни разу не
//входивший в расчёт, — строками по комментариям начислений, как в регистре; частично выплаченный (перенос старой
//выплаты, R01 ревью 28.09) — одной строкой остатка; выплаченный целиком — не берётся (иначе второй расчёт за тот
//же месяц выплатил бы его ещё раз). В таблицу — только уроки и начисления педагогам (РКО и сами расчёты тоже
//двигают регистр, но это не начисления).
Процедура ЗаполнитьНачисления() Экспорт

	ДД.Очистить();
	Начисления = Документы.УЗ_РасчетЗарплаты.НевыплаченныеНачисления(Педагог, Организация, НачалоДня(ДатаНачала),
		КонецДня(ДатаОкончания), Ссылка);
	Для Каждого Начисление Из Начисления Цикл
		СтрокаТЧ = ДД.Добавить();
		СтрокаТЧ.Документ    = Начисление.Документ;
		СтрокаТЧ.Комментарий = Начисление.Комментарий;
		СтрокаТЧ.Начисление  = Начисление.Сумма;
		СтрокаТЧ.КОплате     = Начисление.Сумма;
	КонецЦикла;
	СуммаДокумента = ДД.Итог("КОплате");

КонецПроцедуры

//«Переместить деньги»: всё, что можно взять из кассы расчёта, — в основную кассу. Сумма — та же функция, что
//проверит проведение перемещения (Справочники.УЗ_Кассы.ДоступныйОстатокДляРасхода: деньги организации расчёта в кассе,
//меньшее из остатка сейчас и с документами будущих дат — В12, В14); прежде бралась вся касса по всем организациям с
//будущими приходами, и перемещение само себе отказывало. Возвращает проведённое
//перемещение или пустую ссылку (причина — сообщением пользователю).
Функция ПереместитьОстатокВОсновнуюКассу() Экспорт

	Если НЕ ЗначениеЗаполнено(Касса) Тогда
		СообщитьПользователю(НСтр("ru = 'Не указана касса — перемещать не из чего.'"));
		Возврат Документы.УЗ_ПеремещениеДенег.ПустаяСсылка();
	КонецЕсли;
	КассаПолучатель = Справочники.УЗ_Кассы.ПолучитьОсновнуюКассу();
	Если Касса = КассаПолучатель Тогда
		СообщитьПользователю(СтрШаблон(НСтр("ru = 'Касса %1 и есть основная — перемещать некуда.'"), Касса));
		Возврат Документы.УЗ_ПеремещениеДенег.ПустаяСсылка();
	КонецЕсли;
	//перемещение без организации получит организацию из настроек (C03) — остаток считаем по ней же
	ОрганизацияПеремещения =
		?(ЗначениеЗаполнено(Организация), Организация, РегистрыСведений.УЗ_Настройки.Настройки().Организация);
	Остаток = Справочники.УЗ_Кассы.ДоступныйОстатокДляРасхода(Касса, Неопределено, ОрганизацияПеремещения);
	Если Остаток <= 0 Тогда
		СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'В кассе %1 нечего перемещать: остаток %2.'"), Касса, Формат(Остаток, "ЧДЦ=2; ЧН=0")));
		Возврат Документы.УЗ_ПеремещениеДенег.ПустаяСсылка();
	КонецЕсли;

	НовоеПеремещение = Документы.УЗ_ПеремещениеДенег.СоздатьДокумент();
	//остаток взят на текущий момент — и перемещение текущим моментом, а не концом периода расчёта
	НовоеПеремещение.Дата             = ТекущаяДатаСеанса();
	НовоеПеремещение.ВидОперации      = Перечисления.УЗ_ВидыОпераций.ВнутренняяКасса;
	Если НЕ Ссылка.Пустая() Тогда
		НовоеПеремещение.ДокументОснования = Ссылка;
	КонецЕсли;
	НовоеПеремещение.АвторДокумента   = УЗ_Среда.ТекущийПользователь();
	НовоеПеремещение.КассаОтправитель = Касса;
	НовоеПеремещение.КассаПолучатель  = КассаПолучатель;
	НовоеПеремещение.Клиент           = Педагог;
	НовоеПеремещение.Сумма            = Остаток;
	НовоеПеремещение.Организация      = ОрганизацияПеремещения;
	Попытка
		НовоеПеремещение.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СообщитьПользователю(НСтр("ru = 'Не удалось провести перемещение: '")
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Документы.УЗ_ПеремещениеДенег.ПустаяСсылка();
	КонецПопытки;
	Возврат НовоеПеремещение.Ссылка;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = УЗ_Среда.ТекущийПользователь();
	КонецЕсли;

	//«К оплате» = начисление (колонка только для чтения, как в ведомостях типовых): ведомость выплачивает строку
	//целиком. Прежде «К оплате» меньше начисления оставляло недоплату в долге, а урок из следующих расчётов
	//исключался — выплатить разницу было нечем (долг «зависал»). Выплата частями — несколькими РКО по расчёту.
	Для Каждого СтрокаДД Из ДД Цикл
		Если СтрокаДД.КОплате <> СтрокаДД.Начисление Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект,
				СтрШаблон(НСтр(
				"ru = 'Строка %1: «К оплате» (%2) не равно начислению (%3) — изменить сумму к оплате нельзя: ведомость "
				+ "выплачивает начисление целиком. Выплату частями оформляют несколькими расходными ордерами по "
				+ "расчёту.'"),
				СтрокаДД.НомерСтроки, Формат(СтрокаДД.КОплате, "ЧДЦ=2; ЧН=0"),
					Формат(СтрокаДД.Начисление, "ЧДЦ=2; ЧН=0")),
				"Объект.ДД[" + Формат(СтрокаДД.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].КОплате", Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;

	//к выплате — всегда итог таблицы: смена педагога или периода очищает таблицу, и прежняя сумма
	//не должна уйти в РКО
	СуммаДокумента = ДД.Итог("КОплате");

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьЗапретПоПериоду(Отказ, Истина);
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьЗапретПоПериоду(Отказ, Ложь);
	КонецЕсли;

	Если НЕ ЭтоНовый() Тогда
		ПроверитьИзменениеОплаченного(Отказ, РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Или ПометкаУдаления);
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ПроверитьЗапретПоПериоду(Отказ, Ложь);
	ПроверитьИзменениеОплаченного(Отказ, Истина);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	АвторДокумента = Неопределено;
	Комментарий    = Неопределено;
	//копия — расчёт за другой период: прежние РКО, перемещение и начисления к ней не относятся
	РКО            = Неопределено;
	Перемещение    = Неопределено;
	ДД.Очистить();
	СуммаДокумента = 0;

	Если Не ЗначениеЗаполнено(ОбъектКопирования.Организация) Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;

КонецПроцедуры

//Проводить расчёт без педагога, периода или с нулём к оплате бессмысленно: движение на 0 ничего не начисляет,
//а документ в журнале выглядит выплатой.
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЗначениеЗаполнено(Педагог) Тогда
		УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, НСтр("ru = 'Не указан педагог.'"), "Объект.Педагог", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, НСтр("ru = 'Не указан период начисления.'"), "Период", Отказ);
	ИначеЕсли СуммаДокумента = 0 Тогда
		УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект,
			НСтр("ru = 'Сумма к оплате 0 — нечего проводить. Нажмите «Заполнить и рассчитать»: в таблицу попадут уроки "
			+ "педагога за период.'"),
			"Объект.СуммаДокумента", Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//проверка заполнения сама вызывается только при проведении из формы; программное проведение (обработки,
	//COM) нуля тоже не пропускает
	Если СуммаДокумента = 0 Тогда
		УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект,
			НСтр("ru = 'Сумма к оплате 0 — нечего проводить. Нажмите «Заполнить и рассчитать»: в таблицу попадут уроки "
			+ "педагога за период.'"),
			"Объект.СуммаДокумента", Отказ);
		Возврат;
	КонецЕсли;

	//источник (урок, начисление педагогу) в расчётах — не больше его текущего начисления: уже вошедшее в другой
	//проведённый расчёт второй раз не выплачиваем (В9), а ведомость, записанную до изменения начисления источника,
	//с прежней суммой не проводим (R03 ревью 28.09: начисление 1 000 → 600, ведомость 1 000 выплатила бы 400 сверх)
	ПроверитьНачисленияИсточников(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// регистр УЗ_РасчетыПоЗарплате Приход
	Движения.УЗ_РасчетыПоЗарплате.Записывать = Истина;
	Движение = Движения.УЗ_РасчетыПоЗарплате.Добавить();
	Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
	Движение.Период 	 		= ДатаДвижений();
	Движение.Педагог 	 		= Педагог;
	Движение.ЗП					= СуммаДокумента;
	Движение.Организация		= Организация;

	// регистр УЗ_РасчетыПоЗарплате Расход
	Движения.УЗ_РасчетыПоЗарплате.Записывать = Истина;
	Движение = Движения.УЗ_РасчетыПоЗарплате.Добавить();
	Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
	Движение.Период 	 		= ДатаДвижений();
	Движение.Педагог 	 		= Педагог;
	Движение.ЗП					= СуммаДокумента;
	Движение.Организация		= Организация;

	Движения.УЗ_УрокиВРасчетахЗарплаты.Записывать = Истина;
	ЗаписатьУрокиВРасчете(Движения.УЗ_УрокиВРасчетахЗарплаты, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//N01: по расчёту есть проведённая выплата (РКО «Выплата зарплаты» на его основании) — его нельзя отменить,
//пометить на удаление, удалить и нельзя менять педагога, организацию, период, начисления и сумму. Иначе
//начисления ведомости освобождались и входили в новый расчёт, который выплачивался ещё раз: начислено 1 000,
//выдано 2 000. Сначала отменяют выплаты — тогда расчёт снова можно менять (как в типовых: ведомость с
//проведённой выплатой не отменяется). Отмена — ОтменаПроведения, пометка удаления или удаление.
Процедура ПроверитьИзменениеОплаченного(Отказ, Отмена)

	Выплаты = ПроведенныеВыплаты();
	Если Выплаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Отмена Тогда
		Действие = НСтр("ru = 'отменить, пометить на удаление или удалить'");
	ИначеЕсли ИзмененоСодержание() Тогда
		Действие = НСтр("ru = 'изменить педагога, организацию, период, начисления или сумму'");
	Иначе
		Возврат;
	КонецЕсли;
	УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект,
		СтрШаблон(НСтр(
		"ru = 'По расчёту уже выплачена зарплата (%1) — его нельзя %2: начисления ведомости выплатились бы второй раз. "
		+ "Сначала отмените проведение выплаты.'"),
		СтрСоединить(Выплаты, ", "), Действие), "Объект.ДД", Отказ);

КонецПроцедуры

//Проведённые выплаты зарплаты (РКО) на основании этого расчёта — представления для сообщения.
Функция ПроведенныеВыплаты()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_РасходДенег КАК Выплаты
	|ГДЕ
	|	Выплаты.Проведен
	|	И Выплаты.ДокументОснования = &Расчет
	|	И Выплаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыОпераций.ВыплатаЗарплаты)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выплаты.Дата";
	Запрос.УстановитьПараметр("Расчет", Ссылка);
	Итог = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Итог.Добавить(Строка(Выборка.Ссылка));
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Отличается ли то, что определяет выплату (педагог, организация, период, строки начислений, сумма), от
//записанного в базе.
Функция ИзмененоСодержание()

	Прежний = Ссылка;
	Если Прежний.Педагог <> Педагог Или Прежний.Организация <> Организация
		Или Прежний.ДатаНачала <> ДатаНачала Или Прежний.ДатаОкончания <> ДатаОкончания
		Или Прежний.СуммаДокумента <> СуммаДокумента Или Прежний.ДД.Количество() <> ДД.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	Для Каждого СтрокаДД Из ДД Цикл
		СтрокаПрежняя = Прежний.ДД[СтрокаДД.НомерСтроки - 1];
		Если СтрокаПрежняя.Документ <> СтрокаДД.Документ Или СтрокаПрежняя.Начисление <> СтрокаДД.Начисление
			Или СтрокаПрежняя.КОплате <> СтрокаДД.КОплате Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

//Движения расчёта датированы концом периода, а не датой документа.
Функция ДатаДвижений()

	Возврат КонецДня(ДатаОкончания);

КонецФункции

//Источники таблицы (уроки, начисления педагогам) против их ТЕКУЩИХ начислений (В9, как ведомость в типовых):
//сумма источника в этом расчёте плюс в других проведённых расчётах педагога (расчёт с проведённой выплатой — и
//непроведённый, N01) не больше начисления источника в регистре сейчас. Больше — отказ: целиком уже вошедший в
//другой расчёт источник второй раз не выплачивается; источник, начисление которого уменьшили после заполнения
//ведомости (R03), — перезаполнить. Невыплаченный остаток источника (начисление выросло, выплачено частично —
//перенос старой выплаты) ЗаполнитьНачисления берёт в следующий расчёт.
//Блокировка — на начисления педагога в регистре: два расчёта одного педагога, проводимые одновременно, не пройдут
//эту проверку оба, начисление источника не изменится между проверкой и записью.
Процедура ПроверитьНачисленияИсточников(Отказ)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.УЗ_РасчетыПоЗарплате");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Педагог", Педагог);
	Блокировка.Заблокировать();

	ВЭтом = Новый Соответствие;
	Для Каждого СтрокаДД Из ДД Цикл
		Если ЗначениеЗаполнено(СтрокаДД.Документ) Тогда
			ВЭтом.Вставить(СтрокаДД.Документ, ?(ВЭтом[СтрокаДД.Документ] = Неопределено, 0, ВЭтом[СтрокаДД.Документ])
				+ СтрокаДД.КОплате);
		КонецЕсли;
	КонецЦикла;
	Если ВЭтом.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СписокДокументов = Новый Массив;
	Для Каждого Элемент Из ВЭтом Цикл
		СписокДокументов.Добавить(Элемент.Ключ);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Регистратор КАК Документ,
	|	СУММА(Начисления.Сумма) КАК Начислено
	|ИЗ
	|	РегистрНакопления.УЗ_РасчетыПоЗарплате КАК Начисления
	|ГДЕ
	|	Начисления.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Начисления.Активность
	|	И Начисления.Педагог = &Педагог
	|	И Начисления.Организация = &Организация
	|	И Начисления.Регистратор В (&Документы)
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Другие.Документ КАК Документ,
	|	Другие.Ссылка КАК Расчет,
	|	СУММА(Другие.КОплате) КАК Выплачено
	|ИЗ
	|	Документ.УЗ_РасчетЗарплаты.ДД КАК Другие
	|ГДЕ
	|	Другие.Ссылка <> &Ссылка
	|	И (Другие.Ссылка.Проведен
	|			ИЛИ Другие.Ссылка В (ВЫБРАТЬ Выплаты.ДокументОснования ИЗ Документ.УЗ_РасходДенег КАК Выплаты
	|				ГДЕ Выплаты.Проведен И Выплаты.ВидОперации =
	|		ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыОпераций.ВыплатаЗарплаты)))
	|	И Другие.Ссылка.Педагог = &Педагог
	|	И Другие.Документ В (&Документы)
	|
	|СГРУППИРОВАТЬ ПО
	|	Другие.Документ,
	|	Другие.Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Педагог", Педагог);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Документы", СписокДокументов);
	Результаты = Запрос.ВыполнитьПакет();
	Начислено = Новый Соответствие;
	Выборка = Результаты[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Начислено.Вставить(Выборка.Документ, Выборка.Начислено);
	КонецЦикла;
	ВДругих = Новый Соответствие;
	ПервыйРасчет = Новый Соответствие;
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ВДругих.Вставить(Выборка.Документ, ?(ВДругих[Выборка.Документ] = Неопределено, 0, ВДругих[Выборка.Документ])
			+ Выборка.Выплачено);
		Если ПервыйРасчет[Выборка.Документ] = Неопределено Тогда
			ПервыйРасчет.Вставить(Выборка.Документ, Выборка.Расчет);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Элемент Из ВЭтом Цикл
		Источник = Элемент.Ключ;
		Сейчас = ?(Начислено[Источник] = Неопределено, 0, Начислено[Источник]);
		Другие = ?(ВДругих[Источник] = Неопределено, 0, ВДругих[Источник]);
		Если Другие + Элемент.Значение <= Сейчас Тогда
			Продолжить;
		КонецЕсли;
		Если Другие > 0 И Другие >= Сейчас Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект,
				СтрШаблон(НСтр(
				"ru = '%1 уже вошло в %2 — второй раз не выплачивается. Нажмите «Заполнить и рассчитать».'"),
				Источник, ПервыйРасчет[Источник]), "Объект.ДД", Отказ);
		Иначе
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект,
				СтрШаблон(НСтр(
				"ru = '%1: начислено сейчас %2, в других расчётах %3, в этом расчёте %4 — начисление изменилось после "
				+ "заполнения ведомости, выплатить больше начисленного нельзя. Нажмите «Заполнить и рассчитать».'"),
				Источник, Формат(Сейчас, "ЧДЦ=2; ЧН=0"), Формат(Другие, "ЧДЦ=2; ЧН=0"),
					Формат(Элемент.Значение, "ЧДЦ=2; ЧН=0")),
				"Объект.ДД", Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура СообщитьПользователю(Текст)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры

//Движения расчёта датированы концом периода, а подписка УЗ_ДатаЗапретаПередЗаписью проверяет только дату
//документа: расчёт от 28.09 за август писал бы в закрытый август. Здесь — дата движений: новая (при
//проведении) и прежняя, уже записанная в регистр (при перепроведении, отмене проведения, удалении).
Процедура ПроверитьЗапретПоПериоду(Отказ, НовыеДвижения)

	Граница = УЗ_ДатыЗапрета.ДатаЗапрета();
	Если НЕ ЗначениеЗаполнено(Граница) Тогда
		Возврат;
	КонецЕсли;
	Граница = КонецДня(Граница);

	ДатыДвижений = Новый Массив;
	Если НовыеДвижения И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатыДвижений.Добавить(ДатаДвижений());
	КонецЕсли;
	Если НЕ ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(Движения.Период) КАК Период
		|ИЗ
		|	РегистрНакопления.УЗ_РасчетыПоЗарплате КАК Движения
		|ГДЕ
		|	Движения.Регистратор = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Период) Тогда
			ДатыДвижений.Добавить(Выборка.Период);
		КонецЕсли;
	КонецЕсли;

	Для Каждого ДатаПроверки Из ДатыДвижений Цикл
		Если ДатаПроверки <= Граница Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект,
				СтрШаблон(НСтр(
				"ru = 'Движения расчёта датированы %1 — это закрытый период: изменять по %2 включительно запрещено "
				+ "(Настройки → Даты запрета изменения).'"),
				Формат(ДатаПроверки, "ДЛФ=D"), Формат(Граница, "ДЛФ=D")), "Период", Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
